In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
#使用魔法指令
%matplotlib inline

#对plt进行设置,避免中文乱码,注意Mac可用的字体是Arial Unicode MS
plt.rcParams['font.sans-serif'] = ['Arial Unicode MS']
plt.rcParams['axes.unicode_minus'] = False#正常显示负号
pd.__version__

'1.0.1'

# pandas

In [3]:
nd  = np.array([1,2,3.4,56,7])
s = Series(nd)
s

0     1.0
1     2.0
2     3.4
3    56.0
4     7.0
dtype: float64

In [4]:
s4 = Series([4,3,3,3,3,np.nan,99])
s4

0     4.0
1     3.0
2     3.0
3     3.0
4     3.0
5     NaN
6    99.0
dtype: float64

In [5]:
s1 = Series(nd, index = ['d', 'f', 'd', 'a', 'f',])
s1

d     1.0
f     2.0
d     3.4
a    56.0
f     7.0
dtype: float64

In [6]:
s = Series([1,2,3,4,5,6,7,8,9,], index=list('abcdefghi'))
s

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
i    9
dtype: int64

In [7]:
s = Series({'a':1,'b':2,'c':3,'d':4,'e':5})
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
s['a']

1

In [9]:
s[3]

4

In [10]:
s.loc['c'] #显式索引

3

In [11]:
s.iloc[2]#隐式索引

3

In [12]:
s[2:5]#切片

c    3
d    4
e    5
dtype: int64

In [13]:
s5 = Series(['a','b','c','d','e','f','g'], index=list('1234567'))
s5

1    a
2    b
3    c
4    d
5    e
6    f
7    g
dtype: object

In [14]:
s5.loc['5']#注意要加引号

'e'

In [15]:
s5.iloc[5]

'f'

In [16]:
s1 = Series([2,4,5,6], index = [1,2,3,4])
s2 = Series([3,4,5,6], index = [3,4,5,6])

In [17]:
s1+s2   #  Series相加, 有索引值, 会按照相同索引相加

1     NaN
2     NaN
3     8.0
4    10.0
5     NaN
6     NaN
dtype: float64

### 如果保留所有的值,要使用add()相加,   fill_value =0

In [18]:
s1.add(s2,fill_value =0)

1     2.0
2     4.0
3     8.0
4    10.0
5     5.0
6     6.0
dtype: float64

In [19]:
Series.add(s1,s2,fill_value =0)

1     2.0
2     4.0
3     8.0
4    10.0
5     5.0
6     6.0
dtype: float64

In [20]:
# .add(other, level=None, fill_value=None, axis=0)

In [21]:
s1.add(s2,fill_value=3)

1     5.0
2     7.0
3     8.0
4    10.0
5     8.0
6     9.0
dtype: float64

In [22]:
s1.add(s2,fill_value=0)/2#计算两次的平均成绩

1    1.0
2    2.0
3    4.0
4    5.0
5    2.5
6    3.0
dtype: float64

In [23]:
df = pd.read_json('data/dbookmini.json')
df.head()

  bookName       author publishing   pubTime   Price  score  peapleNum
0       活着           余华      作家出版社  2012-8-1  20.00元    9.3     229378
1    解忧杂货店     [日] 东野圭吾     南海出版公司    2014-5  39.50元    8.5     431667
2    追风筝的人  [美] 卡勒德·胡赛尼    上海人民出版社    2006-5  29.00元    8.9     444305
3       三体          刘慈欣      重庆出版社    2008-1   23.00    8.8     263816
4      白夜行     [日] 东野圭吾     南海出版公司    2008-9  29.80元    9.1     319366

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
bookname = df['bookName']
bookname.head()

0       活着
1    解忧杂货店
2    追风筝的人
3       三体
4      白夜行
Name: bookName, dtype: object

In [26]:
type(bookname)

pandas.core.series.Series

In [27]:
bookname.tail()

993      无声的证词
994    银河帝国：基地
995     安尼尔的鬼魂
996      夏肌の体温
997        巨流河
Name: bookName, dtype: object

# DataFrame

In [28]:
df = pd.read_json('data/dbookmini.json')

In [29]:
df.head()

  bookName       author publishing   pubTime   Price  score  peapleNum
0       活着           余华      作家出版社  2012-8-1  20.00元    9.3     229378
1    解忧杂货店     [日] 东野圭吾     南海出版公司    2014-5  39.50元    8.5     431667
2    追风筝的人  [美] 卡勒德·胡赛尼    上海人民出版社    2006-5  29.00元    8.9     444305
3       三体          刘慈欣      重庆出版社    2008-1   23.00    8.8     263816
4      白夜行     [日] 东野圭吾     南海出版公司    2008-9  29.80元    9.1     319366

In [30]:
df.tail()

,bookName,author,publishing,pubTime,Price,score,peapleNum
993,无声的证词,法医秦明,江苏凤凰文艺出版社,2019-4-30,48.00元,8.3,38
994,银河帝国：基地,[美] 艾萨克·阿西莫夫,江苏文艺出版社,2012-3,29.90元,9.0,9119
995,安尼尔的鬼魂,[加拿大] 迈克尔·翁达杰,人民文学出版社,2016-5-1,45.00,8.2,727
996,夏肌の体温,松崎司,オークラ出版,2015-10-10,JPY 680,8.6,536
997,巨流河,齐邦媛,生活·读书·新知三联书店,2010-10,39.00元,8.7,21111

In [31]:
display(df.index, df.columns, df.values[:3], df.values.shape)

RangeIndex(start=0, stop=998, step=1)

Index(['bookName', 'author', 'publishing', 'pubTime', 'Price', 'score',
       'peapleNum'],
      dtype='object')

array([['活着', '余华', '作家出版社', '2012-8-1', '20.00元', 9.3, 229378],
       ['解忧杂货店', '[日] 东野圭吾', '南海出版公司', '2014-5', '39.50元', 8.5, 431667],
       ['追风筝的人', '[美] 卡勒德·胡赛尼', '上海人民出版社', '2006-5', '29.00元', 8.9,
        444305]], dtype=object)

(998, 7)

dataframe的创建

In [32]:
df1 = DataFrame({'h':[173,175,190,192], 'age':[34,25,47,55],'sex':['m','f','m','f']}, index = list('abcd'), columns = ['h','age','sex','weight'])

### DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

In [33]:
df1

     h  age sex weight
a  173   34   m    NaN
b  175   25   f    NaN
c  190   47   m    NaN
d  192   55   f    NaN

In [34]:
df1.index = list('2357')
df1

     h  age sex weight
2  173   34   m    NaN
3  175   25   f    NaN
5  190   47   m    NaN
7  192   55   f    NaN

In [35]:
df1.weight = [45, 57, 37, 37]
df1

     h  age sex  weight
2  173   34   m      45
3  175   25   f      57
5  190   47   m      37
7  192   55   f      37

### 对列进行索引

In [36]:
#通过列名称检索列,返回series
df1['sex']

2    m
3    f
5    m
7    f
Name: sex, dtype: object

In [37]:
#通过属性检索,列名字就是属性
df1.age

2    34
3    25
5    47
7    55
Name: age, dtype: int64

## 对行进行索引的方法

### --使用ix[]

### --使用.loc[]加index

### --使用.iloc[]加隐性索引整数

In [38]:
df1.iloc[[2,3]]#还可以检索多行

     h  age sex  weight
5  190   47   m      37
7  192   55   f      37

In [39]:
df1.index = list('abcd')
df1

     h  age sex  weight
a  173   34   m      45
b  175   25   f      57
c  190   47   m      37
d  192   55   f      37

In [40]:
df1.loc['b']

h         175
age        25
sex         f
weight     57
Name: b, dtype: object

### 以下4种写法都可以

In [41]:
df1.sex.loc['b']

'f'

In [42]:
df1['sex']['b']

'f'

In [43]:
df1.loc['b']['sex']

'f'

In [ ]:
df1.ax[]

In [44]:
df1.loc['b'].sex

'f'

In [45]:
df.head(0)

Empty DataFrame
Columns: [bookName, author, publishing, pubTime, Price, score, peapleNum]
Index: []

In [78]:
df.loc[47:55].Price

47       12.00元
48          NaN
49       16.00元
50       20.00元
51       20.00元
52      129.80元
53    CNY 35.00
54       14.80元
55       19.00元
Name: Price, dtype: object

In [92]:
df2 = DataFrame(np.random.randint(0,150,size = (4,4)), 
                index = ['zhou','chen','liu','li'],
               columns=['语文','数学','英语','计算机'])
df2

       语文   数学   英语  计算机
zhou   11   83   59    4
chen   92   72  102  128
liu     3  110   58  101
li    130  104   42  104

In [91]:
df3 = DataFrame(np.random.randint(0,150,size = (5,4)),
                index = ['zhou','chen','liu','li','hu'],
               columns=['语文','数学','英语','计算机'])
df3

       语文   数学   英语  计算机
zhou  137  112   59    8
chen   32   30   39   81
liu   106   98   84   97
li     27  111  100   63
hu    131   95   91    2

In [93]:
df2-df3

         语文    数学    英语   计算机
chen   60.0  42.0  63.0  47.0
hu      NaN   NaN   NaN   NaN
li    103.0  -7.0 -58.0  41.0
liu  -103.0  12.0 -26.0   4.0
zhou -126.0 -29.0   0.0  -4.0

In [84]:
df4 = df2.add(df3, fill_value = 0)#避免数据相加后出现nan

In [85]:
df5 = DataFrame(np.random.randint(0,150,size = (5,3)),
                index = ['zhou','chen','liu','li','hu'],
               columns=['语文','数学','英语',])
df5

       语文   数学   英语
zhou  106   84  145
chen  129   88   38
liu   114   14    1
li    103  149   92
hu     62   38  123

In [86]:
df2+df5

         数学     英语  计算机     语文
chen  109.0   80.0  NaN  143.0
hu      NaN    NaN  NaN    NaN
li    285.0  192.0  NaN  130.0
liu    18.0    6.0  NaN  213.0
zhou  216.0  181.0  NaN  149.0

In [55]:
df6 = df2.add(df5, fill_value=0)
df6

         数学     英语    计算机     语文
chen  255.0  162.0  145.0  119.0
hu     51.0   21.0    NaN   68.0
li     67.0   72.0   72.0   75.0
liu   134.0  258.0  132.0   94.0
zhou  179.0  249.0  105.0  146.0

In [121]:
df6.计算机.loc['hu'] = 109
df6

         数学     英语    计算机     语文
chen  149.0  260.0   31.0  221.0
hu     78.0   37.0  109.0  102.0
li    147.0  160.0   93.0  141.0
liu   164.0   95.0    1.0  111.0
zhou  193.0  193.0   96.0   72.0

In [11]:
import pymongo

In [12]:
client = pymongo.MongoClient('localhost',27017)
db  = client['scrapy_db']
coll = db['yiqing2020']

In [13]:
df = pd.DataFrame(list(coll.find({},{'_id':0,'spider':0,'crawled':0,'modifyTime':0})))

display(df.head())

  provinceName  confirmedCount cityName  curedCount  deadCount    datadate
0          湖北省           10117       武汉         455        414  2020-02-06
1          湖北省            1886       孝感          30         25  2020-02-06
2          湖北省            1807       黄冈          62         29  2020-02-06
3          湖北省             834       随州           9          9  2020-02-06
4          湖北省             801       荆州          19         10  2020-02-06

In [16]:
df.sort_values('curedCount').head()

,provinceName,confirmedCount,cityName,curedCount,deadCount,datadate
1644,新疆维吾尔自治区,2,兵团第六师五家渠市,0,0,2020-02-17
594,四川省,20,巴中,0,0,2020-02-07
3352,吉林省,1,白城,0,0,2020-02-21
596,四川省,17,内江,0,0,2020-02-07
597,四川省,17,甘孜州,0,0,2020-02-07

In [18]:
df.sort_values('deadCount').tail(20)

     provinceName  confirmedCount cityName  curedCount  deadCount    datadate
1254          湖北省            3279       孝感         449         70  2020-02-17
1680          湖北省            3320       孝感         523         75  2020-02-18
832           湖北省            2823       黄冈         716         75  2020-02-16
1678          湖北省            3320       孝感         523         75  2020-02-18
1255          湖北省            2831       黄冈         838         78  2020-02-17
2104          湖北省            3344       孝感         572         82  2020-02-19
1681          湖北省            2828       黄冈         941         84  2020-02-18
2105          湖北省            2844       黄冈        1059         85  2020-02-19
2527          湖北省            2839       黄冈        1149         87  2020-02-20
2526          湖北省            3329       孝感         673         89  2020-02-20
2953          湖北省            2856       黄冈        1274         90  2020-02-21
2952          湖北省            3346       孝感         771         94  2020-02-21
0             湖北省           10117       武汉         455        414  2020-02-06
414           湖北省           11618       武汉         535        478  2020-02-07
830           湖北省           39462       武汉        2915       1233  2020-02-16
1253          湖北省           41152       武汉        3459       1309  2020-02-17
1679          湖北省           42752       武汉        4219       1381  2020-02-18
2103          湖北省           44412       武汉        4915       1497  2020-02-19
2525          湖北省           45027       武汉        5448       1585  2020-02-20
2951          湖北省           45346       武汉        6214       1684  2020-02-21

In [47]:
df[df.deadCount > 1000]

     provinceName  confirmedCount cityName  curedCount  deadCount    datadate
830           湖北省           39462       武汉        2915       1233  2020-02-16
1253          湖北省           41152       武汉        3459       1309  2020-02-17
1679          湖北省           42752       武汉        4219       1381  2020-02-18
2103          湖北省           44412       武汉        4915       1497  2020-02-19
2525          湖北省           45027       武汉        5448       1585  2020-02-20
2951          湖北省           45346       武汉        6214       1684  2020-02-21

In [116]:
display(df.index, df.columns, df.values[50:53], df.values.shape)

RangeIndex(start=0, stop=2951, step=1)

Index(['provinceName', 'confirmedCount', 'cityName', 'curedCount', 'deadCount',
       'datadate'],
      dtype='object')

array([['河南省', 102, '郑州', 13, 0, '2020-02-06'],
       ['河南省', 98, '驻马店', 2, 0, '2020-02-06'],
       ['河南省', 65, '商丘', 4, 0, '2020-02-06']], dtype=object)

(2951, 6)

In [120]:
df.loc[1000:1020].cityName

1000      开州区
1001      丰都县
1002      铜梁区
1003      巫溪县
1004      巫山县
1005      巴南区
1006      璧山区
1007     大渡口区
1008      永川区
1009      高新区
1010      江津区
1011      涪陵区
1012      彭水县
1013      酉阳县
1014    万盛经开区
1015      梁平区
1016      黔江区
1017      城口县
1018      武隆区
1019      秀山县
1020       成都
Name: cityName, dtype: object

In [124]:
df.loc[79]

provinceName             湖南省
confirmedCount             7
cityName               湘西自治州
curedCount                 1
deadCount                  0
datadate          2020-02-06
Name: 79, dtype: object

In [125]:
se = df.confirmedCount
se

0       10117
1        1886
2        1807
3         834
4         801
        ...
2946        1
2947        0
2948       15
2949        3
2950        1
Name: confirmedCount, Length: 2951, dtype: int64

In [126]:
se[100:200:5]

100    25
105    11
110    19
115    15
120    12
125     9
130     7
135     4
140     2
145     1
150    34
155    22
160    41
165    29
170    15
175    97
180    18
185    11
190     6
195     1
Name: confirmedCount, dtype: int64

In [129]:
np.sum(se)

422817

In [130]:
np.mean(se)

143.27922738054897

In [8]:
import pandas as pd
import numpy as np
dates = pd.date_range('20200101', periods=6)
df1 = pd.DataFrame(np.arange(24).reshape(6,4),index =dates,columns=['a','b','c','d'])
df1

             a   b   c   d
2020-01-01   0   1   2   3
2020-01-02   4   5   6   7
2020-01-03   8   9  10  11
2020-01-04  12  13  14  15
2020-01-05  16  17  18  19
2020-01-06  20  21  22  23

In [9]:
df1.iloc[:2]

            a  b  c  d
2020-01-01  0  1  2  3
2020-01-02  4  5  6  7

In [5]:
df1.loc['20200101':'20200103']

            a  b   c   d
2020-01-01  0  1   2   3
2020-01-02  4  5   6   7
2020-01-03  8  9  10  11

In [33]:
df1.loc['20200103',['a','c']]

a     8
c    10
Name: 2020-01-03 00:00:00, dtype: int64

In [39]:
df1.loc[:,['a','c']]

             a   c
2020-01-01   0   2
2020-01-02   4   6
2020-01-03   8  10
2020-01-04  12  14
2020-01-05  16  18
2020-01-06  20  22

In [44]:
df1.iloc[[1,3],[2,3]]

             c   d
2020-01-02   6   7
2020-01-04  14  15

In [7]:
df1[df1.a>6]#按条件返回

             a   b   c   d
2020-01-03   8   9  10  11
2020-01-04  12  13  14  15
2020-01-05  16  17  18  19
2020-01-06  20  21  22  23

## DataFrame的赋值

In [10]:
df1

             a   b   c   d
2020-01-01   0   1   2   3
2020-01-02   4   5   6   7
2020-01-03   8   9  10  11
2020-01-04  12  13  14  15
2020-01-05  16  17  18  19
2020-01-06  20  21  22  23

In [51]:
df1[df1.a>0] = 0
df1

            a  b  c  d
2020-01-01  0  1  2  3
2020-01-02  0  0  0  0
2020-01-03  0  0  0  0
2020-01-04  0  0  0  0
2020-01-05  0  0  0  0
2020-01-06  0  0  0  0

In [11]:
dates = pd.date_range('20200101', periods=6)
df1 = pd.DataFrame(np.arange(24).reshape(6,4),index =dates,columns=['a','b','c','d'])
df1

             a   b   c   d
2020-01-01   0   1   2   3
2020-01-02   4   5   6   7
2020-01-03   8   9  10  11
2020-01-04  12  13  14  15
2020-01-05  16  17  18  19
2020-01-06  20  21  22  23

In [53]:
df1.a[df1.a>8] = 0
df1

            a   b   c   d
2020-01-01  0   1   2   3
2020-01-02  4   5   6   7
2020-01-03  8   9  10  11
2020-01-04  0  13  14  15
2020-01-05  0  17  18  19
2020-01-06  0  21  22  23

In [12]:
df1['e'] = 10
df1

             a   b   c   d   e
2020-01-01   0   1   2   3  10
2020-01-02   4   5   6   7  10
2020-01-03   8   9  10  11  10
2020-01-04  12  13  14  15  10
2020-01-05  16  17  18  19  10
2020-01-06  20  21  22  23  10

In [13]:
df1['f'] = [1,3,4,5,6,7,]
df1

             a   b   c   d   e  f
2020-01-01   0   1   2   3  10  1
2020-01-02   4   5   6   7  10  3
2020-01-03   8   9  10  11  10  4
2020-01-04  12  13  14  15  10  5
2020-01-05  16  17  18  19  10  6
2020-01-06  20  21  22  23  10  7

In [14]:
df1['g'] = pd.Series([3,5,6,5,6,7],index = dates)
df1

             a   b   c   d   e  f  g
2020-01-01   0   1   2   3  10  1  3
2020-01-02   4   5   6   7  10  3  5
2020-01-03   8   9  10  11  10  4  6
2020-01-04  12  13  14  15  10  5  5
2020-01-05  16  17  18  19  10  6  6
2020-01-06  20  21  22  23  10  7  7

In [15]:
df1.loc[20200107]= [3,5,7,5,6,7,8]
df1

                      a   b   c   d   e  f  g
2020-01-01 00:00:00   0   1   2   3  10  1  3
2020-01-02 00:00:00   4   5   6   7  10  3  5
2020-01-03 00:00:00   8   9  10  11  10  4  6
2020-01-04 00:00:00  12  13  14  15  10  5  5
2020-01-05 00:00:00  16  17  18  19  10  6  6
2020-01-06 00:00:00  20  21  22  23  10  7  7
20200107              3   5   7   5   6  7  8

In [74]:
df1.loc['20200108',list('abcd')]= [5,6,7,8]
df1

                       a     b     c     d     e    f    g
2020-01-01 00:00:00  0.0   1.0   2.0   3.0  10.0  1.0  3.0
2020-01-02 00:00:00  4.0   5.0   6.0   7.0  10.0  3.0  5.0
2020-01-03 00:00:00  8.0   9.0  10.0  11.0  10.0  4.0  6.0
2020-01-04 00:00:00  0.0  13.0  14.0  15.0  10.0  5.0  5.0
2020-01-05 00:00:00  0.0  17.0  18.0  19.0  10.0  6.0  6.0
2020-01-06 00:00:00  0.0  21.0  22.0  23.0  10.0  7.0  7.0
20200107             3.0   5.0   7.0   5.0   6.0  7.0  8.0
20200108             5.0   6.0   7.0   8.0   NaN  NaN  NaN

In [16]:
s1 = pd.Series([43,5,5,76,7,],index=['a','c','d','e','f'])
s1.name = 20200109
df2 = df1.append(s1)
df2

                        a     b     c     d     e    f    g
2020-01-01 00:00:00   0.0   1.0   2.0   3.0  10.0  1.0  3.0
2020-01-02 00:00:00   4.0   5.0   6.0   7.0  10.0  3.0  5.0
2020-01-03 00:00:00   8.0   9.0  10.0  11.0  10.0  4.0  6.0
2020-01-04 00:00:00  12.0  13.0  14.0  15.0  10.0  5.0  5.0
2020-01-05 00:00:00  16.0  17.0  18.0  19.0  10.0  6.0  6.0
2020-01-06 00:00:00  20.0  21.0  22.0  23.0  10.0  7.0  7.0
20200107              3.0   5.0   7.0   5.0   6.0  7.0  8.0
20200109             43.0   NaN   5.0   5.0  76.0  7.0  NaN

In [76]:
df1

                       a     b     c     d     e    f    g
2020-01-01 00:00:00  0.0   1.0   2.0   3.0  10.0  1.0  3.0
2020-01-02 00:00:00  4.0   5.0   6.0   7.0  10.0  3.0  5.0
2020-01-03 00:00:00  8.0   9.0  10.0  11.0  10.0  4.0  6.0
2020-01-04 00:00:00  0.0  13.0  14.0  15.0  10.0  5.0  5.0
2020-01-05 00:00:00  0.0  17.0  18.0  19.0  10.0  6.0  6.0
2020-01-06 00:00:00  0.0  21.0  22.0  23.0  10.0  7.0  7.0
20200107             3.0   5.0   7.0   5.0   6.0  7.0  8.0
20200108             5.0   6.0   7.0   8.0   NaN  NaN  NaN

In [17]:
df1.insert(1,'h',df2['f'])
#df1.insert(loc, column, value, allow_duplicates=False) -> None
df1

                      a    h   b   c   d   e  f  g
2020-01-01 00:00:00   0  1.0   1   2   3  10  1  3
2020-01-02 00:00:00   4  3.0   5   6   7  10  3  5
2020-01-03 00:00:00   8  4.0   9  10  11  10  4  6
2020-01-04 00:00:00  12  5.0  13  14  15  10  5  5
2020-01-05 00:00:00  16  6.0  17  18  19  10  6  6
2020-01-06 00:00:00  20  7.0  21  22  23  10  7  7
20200107              3  7.0   5   7   5   6  7  8

In [86]:
df1

                       a    h     b     c     d     e    f    g
2020-01-01 00:00:00  0.0  1.0   1.0   2.0   3.0  10.0  1.0  3.0
2020-01-02 00:00:00  4.0  3.0   5.0   6.0   7.0  10.0  3.0  5.0
2020-01-03 00:00:00  8.0  4.0   9.0  10.0  11.0  10.0  4.0  6.0
2020-01-04 00:00:00  0.0  5.0  13.0  14.0  15.0  10.0  5.0  5.0
2020-01-05 00:00:00  0.0  6.0  17.0  18.0  19.0  10.0  6.0  6.0
2020-01-06 00:00:00  0.0  7.0  21.0  22.0  23.0  10.0  7.0  7.0
20200107             3.0  7.0   5.0   7.0   5.0   6.0  7.0  8.0
20200108             5.0  NaN   6.0   7.0   8.0   NaN  NaN  NaN

In [18]:
#移动列的位置
h= df1.pop('h')#弹出要移动的列

df1.insert(7,'h',h)#插入到需要的位置

In [19]:
df1

                      a   b   c   d   e  f  g    h
2020-01-01 00:00:00   0   1   2   3  10  1  3  1.0
2020-01-02 00:00:00   4   5   6   7  10  3  5  3.0
2020-01-03 00:00:00   8   9  10  11  10  4  6  4.0
2020-01-04 00:00:00  12  13  14  15  10  5  5  5.0
2020-01-05 00:00:00  16  17  18  19  10  6  6  6.0
2020-01-06 00:00:00  20  21  22  23  10  7  7  7.0
20200107              3   5   7   5   6  7  8  7.0

In [32]:
df2 = df1.reindex(columns=['a','c','d','b','h','g','f','e','i'],fill_value=0)#按照列索引重新排列，但不改变df1本身
#df1.reindex（labels=None,index=None,columns=None,axis=None,method=None,copy=True,level=None,fill_value=nan,limit=None,tolerance=None,)
df2

                      a   c   d   b    h  g  f   e  i
2020-01-01 00:00:00   0   2   3   1  1.0  3  1  10  0
2020-01-02 00:00:00   4   6   7   5  3.0  5  3  10  0
2020-01-03 00:00:00   8  10  11   9  4.0  6  4  10  0
2020-01-04 00:00:00  12  14  15  13  5.0  5  5  10  0
2020-01-05 00:00:00  16  18  19  17  6.0  6  6  10  0
2020-01-06 00:00:00  20  22  23  21  7.0  7  7  10  0
20200107              3   7   5   5  7.0  8  7   6  0

In [39]:
df2.name= 'new'
df2.index.name='时间'
display(df2)

                      a   c   d   b    h  g  f   e  i
时间
2020-01-01 00:00:00   0   2   3   1  1.0  3  1  10  0
2020-01-02 00:00:00   4   6   7   5  3.0  5  3  10  0
2020-01-03 00:00:00   8  10  11   9  4.0  6  4  10  0
2020-01-04 00:00:00  12  14  15  13  5.0  5  5  10  0
2020-01-05 00:00:00  16  18  19  17  6.0  6  6  10  0
2020-01-06 00:00:00  20  22  23  21  7.0  7  7  10  0
20200107              3   7   5   5  7.0  8  7   6  0

In [90]:
del df1['a']

In [91]:
df1

                        b     c     d     e    f    g    h
2020-01-01 00:00:00   1.0   2.0   3.0  10.0  1.0  3.0  1.0
2020-01-02 00:00:00   5.0   6.0   7.0  10.0  3.0  5.0  3.0
2020-01-03 00:00:00   9.0  10.0  11.0  10.0  4.0  6.0  4.0
2020-01-04 00:00:00  13.0  14.0  15.0  10.0  5.0  5.0  5.0
2020-01-05 00:00:00  17.0  18.0  19.0  10.0  6.0  6.0  6.0
2020-01-06 00:00:00  21.0  22.0  23.0  10.0  7.0  7.0  7.0
20200107              5.0   7.0   5.0   6.0  7.0  8.0  7.0
20200108              6.0   7.0   8.0   NaN  NaN  NaN  NaN

In [40]:
df2 = df1.drop(['g','h'],axis=1)
display(df1)
display(df2)

                      a   b   c   d   e  f  g    h
时间
2020-01-01 00:00:00   0   1   2   3  10  1  3  1.0
2020-01-02 00:00:00   4   5   6   7  10  3  5  3.0
2020-01-03 00:00:00   8   9  10  11  10  4  6  4.0
2020-01-04 00:00:00  12  13  14  15  10  5  5  5.0
2020-01-05 00:00:00  16  17  18  19  10  6  6  6.0
2020-01-06 00:00:00  20  21  22  23  10  7  7  7.0
20200107              3   5   7   5   6  7  8  7.0

                      a   b   c   d   e  f
时间
2020-01-01 00:00:00   0   1   2   3  10  1
2020-01-02 00:00:00   4   5   6   7  10  3
2020-01-03 00:00:00   8   9  10  11  10  4
2020-01-04 00:00:00  12  13  14  15  10  5
2020-01-05 00:00:00  16  17  18  19  10  6
2020-01-06 00:00:00  20  21  22  23  10  7
20200107              3   5   7   5   6  7

# df.reindex(columns = ['a','b','c','d','e'])#重新排列列索引
# df.reindex(index = [。。。。。)#重新排列行索引